app/Controllers/Home.php

    public function index(): string
    {
        $usermodel = new UserModel();
        $data['listofusers'] = $usermodel->findAll();
---
SELECT *
FROM `users`

    public function edit($id)
    {
        $usermodel = new UserModel();
        $data['user'] = $usermodel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'

    public function delete($id)
    {
        $usermodel = new UserModel();
        $usermodel->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('5')